# 백준 2884 하하 if 문 - 알람 시계

# 내 풀이(코드길이 403B)

h, m = input().split()

h = int(h)
m = int(m)

# 만약 현재 알람시각이 45-59분이면
# M을 00-14로 바꾸면 됨
# 만약 현재 알람시각이 00-44분이면
# H를 1 빼고, M을 15-59로 바꾸면 됨
   # 근데 만약 H가 0이면 H를 23으로 바꿈

if 44 < m:
   m = m - 45
elif m < 45:
   m = m + 15
   if 1 <= h <= 23:
      h = h - 1
   else:
      h = 23

print(h, m)


# 다른 사람의 풀이(코드길이 252B)

H, M = map(int, input().split())

if M < 45 :	# 분단위가 45분보다 작을 때 
    if H == 0 :	# 0 시이면
        H = 23
        M += 60
    else :	# 0시가 아니면 (0시보다 크면)
        H -= 1	
        M += 60
        
print(H, M-45)
